export const main_category = { 
    "0": "総記",
    "1": "哲学",
    "2": "歴史",
    "3": "社会科学",
    "4": "自然科学",
    "5": "技術・工学・工業",
    "6": "産業",
    "7": "芸術・美術",
    "8": "言語",
    "9": "文学"
}


export const sub_category = {
    "0": {
        "000": "総記",
        "010": "図書館・図書館学",
        "020": "図書・書誌学",
        "030": "百科事典",
        "040": "一般論文集・一般講演集",
        "050": "逐次刊行物・年鑑",
        "060": "学会・団体・研究調査機関",
        "070": "ジャーナリズム・新聞",
        "080": "叢書・全集・選集",
        "090": "貴重書・郷土資料・その他の特別コレクション"
    },
    "1":{
        "100": "哲学",
        "110": "哲学各論",
        "120": "東洋思想",
        "130": "西洋哲学",
        "140": "心理学",
        "150": "倫理学・道徳",
        "160": "宗教",
        "170": "神道",
        "180": "仏教",
        "190": "キリスト教"
    },
    "2": {
        "200": "歴史",
        "210": "日本史",
        "220": "アジア史・東洋史",
        "230": "ヨーロッパ史・西洋史",
        "240": "アフリカ史",
        "250": "北アメリカ史",
        "260": "南アメリカ史",
        "270": "オセアニア史・両極地方史",
        "280": "伝記",
        "290": "地理・地誌・紀行"
    },
    "3": {
        "300": "社会科学",
        "310": "政治",
        "320": "法律",
        "330": "経済",
        "340": "財政",
        "350": "統計",
        "360": "社会",
        "370": "教育",

        "380": "風俗習慣・民俗学・民族学",
        "390": "国防・軍事"
    },
    "4": {
        "400": "自然科学",
        "410": "数学",
        "420": "物理学",
        "430": "化学",
        "440": "天文学・宇宙科学",
        "450": "地球科学・地学",
        "460": "生物科学・一般生物学",
        "470": "植物学",
        "480": "動物学",
        "490": "医学"
    },
    "5": {
        "500": "技術・工学・工業",
        "510": "建設工学・土木工学",
        "520": "建築学",
        "530": "機械工学・原子力工学",
        "540": "電気工学・電子工学",
        "550": "海洋工学・船舶工学",
        "560": "金属工学・鉱山工学",
        "570": "化学工業",
        "580": "製造工業",
        "590": "家政学・生活科学"
    },
    "6": {
        "600": "産業",
        "610": "農業",
        "620": "園芸",
        "630": "蚕糸業",
        "640": "畜産業",
        "650": "林業",
        "660": "水産業",
        "670": "商業",
        "680": "運輸・交通",
        "690": "通信事業"
    },
    "7": {
        "700": "芸術・美術",
        "710": "彫刻",
        "720": "絵画",
        "730": "版画",
        "740": "写真",
        "750": "工芸",
        "760": "音楽",
        "770": "演劇",
        "780": "スポーツ・体育",
        "790": "諸芸・娯楽"
    },
    "8": {
        "800": "言語",
        "810": "日本語",
        "820": "中国語",
        "830": "英語",
        "840": "ドイツ語",
        "850": "フランス語",
        "860": "スペイン語",
        "870": "イタリア語",
        "880": "ロシア語",
        "890": "その他の諸言語"
    },
    "9": {
        "900": "文学",
        "910": "日本文学",
        "920": "中国文学",
        "930": "英米文学",
        "940": "ドイツ文学",
        "950": "フランス文学",
        "960": "スペイン文学",
        "970": "イタリア文学",
        "980": "ロシア・ソヴィエト文学",
        "990": "その他の諸文学"
    }
}